IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280015x_epwm_regs.xml
<module id="EPWM_REGS" HW_revision="" description="EPWM Registers">
	<register id="TBCTL" width="16" page="1" offset="0x0" internal="0" description="Time Base Control Register">
		<bitfield id="CTRMODE" description="Counter Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="PHSEN" description="Phase Load Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PRDLD" description="Active Period Load" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SWFSYNC" description="Software Force Sync Pulse" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="HSPCLKDIV" description="High Speed TBCLK Pre-scaler" begin="9" end="7" width="3" rwaccess="RW"/>
		<bitfield id="CLKDIV" description="Time Base Clock Pre-scaler" begin="12" end="10" width="3" rwaccess="RW"/>
		<bitfield id="PHSDIR" description="Phase Direction Bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="FREE_SOFT" description="Emulation Mode Bits" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="TBCTL2" width="16" page="1" offset="0x1" internal="0" description="Time Base Control Register 2">
		<bitfield id="OSHTSYNCMODE" description="One shot sync mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="OSHTSYNC" description="One shot sync" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PRDLDSYNC" description="PRD Shadow to Active Load on SYNC Event" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWMSYNCINSEL" width="16" page="1" offset="0x3" internal="0" description="EPWMxSYNCIN Source Select Register">
		<bitfield id="SEL" description="EPWMxSYNCI source select" begin="4" end="0" width="5" rwaccess="RW"/>
	</register>
	<register id="TBCTR" width="16" page="1" offset="0x4" internal="0" description="Time Base Counter Register">
		<bitfield id="TBCTR" description="Counter Value" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="TBSTS" width="16" page="1" offset="0x5" internal="0" description="Time Base Status Register">
		<bitfield id="CTRDIR" description="Counter Direction Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SYNCI" description="External Input Sync Status" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CTRMAX" description="Counter Max Latched Status" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="EPWMSYNCOUTEN" width="16" page="1" offset="0x6" internal="0" description="EPWMxSYNCOUT Source Enable Register">
		<bitfield id="SWEN" description="EPWMxSYNCO Software Force Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ZEROEN" description="EPWMxSYNCO Zero Count Event Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPBEN" description="EPWMxSYNCO Compare B Event Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPCEN" description="EPWMxSYNCO Compare C Event Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPDEN" description="EPWMxSYNCO Compare D Event Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT1EN" description="EPWMxSYNCO Digital Compare A Event 1 Sync Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT1EN" description="EPWMxSYNCO Digital Compare B Event 1 Sync Enable" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="TBCTL3" width="16" page="1" offset="0x7" internal="0" description="Time Base Control Register 3">
		<bitfield id="OSSFRCEN" description="One Shot Sync Force Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPCTL" width="16" page="1" offset="0x8" internal="0" description="Counter Compare Control Register">
		<bitfield id="LOADAMODE" description="Active Compare A Load" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOADBMODE" description="Active Compare B Load" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="SHDWAMODE" description="Compare A Register Block Operating Mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SHDWBMODE" description="Compare B Register Block Operating Mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SHDWAFULL" description="Compare A Shadow Register Full Status" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SHDWBFULL" description="Compare B Shadow Register Full Status" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="LOADASYNC" description="Active Compare A Load on SYNC" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="LOADBSYNC" description="Active Compare B Load on SYNC" begin="13" end="12" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPCTL2" width="16" page="1" offset="0x9" internal="0" description="Counter Compare Control Register 2">
		<bitfield id="LOADCMODE" description="Active Compare C Load" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOADDMODE" description="Active Compare D load" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="SHDWCMODE" description="Compare C Block Operating Mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SHDWDMODE" description="Compare D Block Operating Mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="LOADCSYNC" description="Active Compare C Load on SYNC" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="LOADDSYNC" description="Active Compare D Load on SYNC" begin="13" end="12" width="2" rwaccess="RW"/>
	</register>
	<register id="DBCTL" width="16" page="1" offset="0xc" internal="0" description="Dead-Band Generator Control Register">
		<bitfield id="OUT_MODE" description="Dead Band Output Mode Control" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="POLSEL" description="Polarity Select Control" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="IN_MODE" description="Dead Band Input Select Mode Control" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="LOADREDMODE" description="Active DBRED Load Mode" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="LOADFEDMODE" description="Active DBFED Load Mode" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="SHDWDBREDMODE" description="DBRED Block Operating Mode" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SHDWDBFEDMODE" description="DBFED Block Operating Mode" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="OUTSWAP" description="Dead Band Output Swap Control" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="DEDB_MODE" description="Dead Band Dual-Edge B Mode Control" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="HALFCYCLE" description="Half Cycle Clocking Enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="DBCTL2" width="16" page="1" offset="0xd" internal="0" description="Dead-Band Generator Control Register 2">
		<bitfield id="LOADDBCTLMODE" description="DBCTL Load from Shadow Mode Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SHDWDBCTLMODE" description="DBCTL Load mode Select" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="AQCTL" width="16" page="1" offset="0x10" internal="0" description="Action Qualifier Control Register">
		<bitfield id="LDAQAMODE" description="Action Qualifier A Load Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LDAQBMODE" description="Action Qualifier B Load Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="SHDWAQAMODE" description="Action Qualifer A Operating Mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SHDWAQBMODE" description="Action Qualifier B Operating Mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="LDAQASYNC" description="AQCTLA Register Load on SYNC" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="LDAQBSYNC" description="AQCTLB Register Load on SYNC" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="AQTSRCSEL" width="16" page="1" offset="0x11" internal="0" description="Action Qualifier Trigger Event Source Select Register">
		<bitfield id="T1SEL" description="T1 Event Source Select Bits" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="T2SEL" description="T2 Event Source Select Bits" begin="7" end="4" width="4" rwaccess="RW"/>
	</register>
	<register id="PCCTL" width="16" page="1" offset="0x14" internal="0" description="PWM Chopper Control Register">
		<bitfield id="CHPEN" description="PWM chopping enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OSHTWTH" description="One-shot pulse width" begin="4" end="1" width="4" rwaccess="RW"/>
		<bitfield id="CHPFREQ" description="Chopping clock frequency" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="CHPDUTY" description="Chopping clock Duty cycle" begin="10" end="8" width="3" rwaccess="RW"/>
	</register>
	<register id="VCAPCTL" width="16" page="1" offset="0x18" internal="0" description="Valley Capture Control Register">
		<bitfield id="VCAPE" description="Valley  Capture mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="VCAPSTART" description="Valley  Capture Start" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="Capture Trigger Select" begin="4" end="2" width="3" rwaccess="RW"/>
		<bitfield id="VDELAYDIV" description="Valley Delay Mode Divide Enable" begin="9" end="7" width="3" rwaccess="RW"/>
		<bitfield id="EDGEFILTDLYSEL" description="Valley Switching Mode Delay Select" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
